{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "id2label": {
    "0": "sadness",
    "1": "anger",
    "2": "love",
    "3": "surprise",
    "4": "fear",
    "5": "happiness",
    "6": "neutral",
    "7": "disgust",
    "8": "shame",
    "9": "guilt",
    "10": "confusion",
    "11": "desire",
    "12": "sarcasm"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "label2id": {
    "anger": 1,
    "confusion": 10,
    "desire": 11,
    "disgust": 7,
    "fear": 4,
    "guilt": 9,
    "happiness": 5,
    "love": 2,
    "neutral": 6,
    "sadness": 0,
    "sarcasm": 12,
    "shame": 8,
    "surprise": 3
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 4,
  "num_hidden_layers": 4,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.6",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
